balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128GP204.PIC
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR3" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="RPOR3" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP6R" edc:desc="" edc:mask="0x1f" edc:name="RP6R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP7R" edc:desc="" edc:mask="0x1f" edc:name="RP7R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP6R0" edc:desc="" edc:mask="0x1" edc:name="RP6R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R1" edc:desc="" edc:mask="0x1" edc:name="RP6R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R2" edc:desc="" edc:mask="0x1" edc:name="RP6R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R3" edc:desc="" edc:mask="0x1" edc:name="RP6R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6R4" edc:desc="" edc:mask="0x1" edc:name="RP6R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP7R0" edc:desc="" edc:mask="0x1" edc:name="RP7R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R1" edc:desc="" edc:mask="0x1" edc:name="RP7R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R2" edc:desc="" edc:mask="0x1" edc:name="RP7R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R3" edc:desc="" edc:mask="0x1" edc:name="RP7R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R4" edc:desc="" edc:mask="0x1" edc:name="RP7R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR4" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="RPOR4" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP8R" edc:desc="" edc:mask="0x1f" edc:name="RP8R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP9R" edc:desc="" edc:mask="0x1f" edc:name="RP9R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP8R0" edc:desc="" edc:mask="0x1" edc:name="RP8R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R1" edc:desc="" edc:mask="0x1" edc:name="RP8R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R2" edc:desc="" edc:mask="0x1" edc:name="RP8R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R3" edc:desc="" edc:mask="0x1" edc:name="RP8R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R4" edc:desc="" edc:mask="0x1" edc:name="RP8R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP9R0" edc:desc="" edc:mask="0x1" edc:name="RP9R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R1" edc:desc="" edc:mask="0x1" edc:name="RP9R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R2" edc:desc="" edc:mask="0x1" edc:name="RP9R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R3" edc:desc="" edc:mask="0x1" edc:name="RP9R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R4" edc:desc="" edc:mask="0x1" edc:name="RP9R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR5" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="RPOR5" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP10R" edc:desc="" edc:mask="0x1f" edc:name="RP10R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP11R" edc:desc="" edc:mask="0x1f" edc:name="RP11R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP10R0" edc:desc="" edc:mask="0x1" edc:name="RP10R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10R1" edc:desc="" edc:mask="0x1" edc:name="RP10R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10R2" edc:desc="" edc:mask="0x1" edc:name="RP10R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10R3" edc:desc="" edc:mask="0x1" edc:name="RP10R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10R4" edc:desc="" edc:mask="0x1" edc:name="RP10R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP11R0" edc:desc="" edc:mask="0x1" edc:name="RP11R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP11R1" edc:desc="" edc:mask="0x1" edc:name="RP11R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP11R2" edc:desc="" edc:mask="0x1" edc:name="RP11R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP11R3" edc:desc="" edc:mask="0x1" edc:name="RP11R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP11R4" edc:desc="" edc:mask="0x1" edc:name="RP11R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR6" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="RPOR6" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP12R" edc:desc="" edc:mask="0x1f" edc:name="RP12R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP13R" edc:desc="" edc:mask="0x1f" edc:name="RP13R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP12R0" edc:desc="" edc:mask="0x1" edc:name="RP12R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R1" edc:desc="" edc:mask="0x1" edc:name="RP12R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R2" edc:desc="" edc:mask="0x1" edc:name="RP12R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R3" edc:desc="" edc:mask="0x1" edc:name="RP12R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R4" edc:desc="" edc:mask="0x1" edc:name="RP12R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP13R0" edc:desc="" edc:mask="0x1" edc:name="RP13R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R1" edc:desc="" edc:mask="0x1" edc:name="RP13R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R2" edc:desc="" edc:mask="0x1" edc:name="RP13R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R3" edc:desc="" edc:mask="0x1" edc:name="RP13R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R4" edc:desc="" edc:mask="0x1" edc:name="RP13R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
